#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

void log_time(char *date, int index);
int random_ch(int min, int max);
void create_ip(char *ip);
int gen_status();
void choose_method(char *method);
void create_url(char *url);
void create_agent(char *agent);
void month_to_stroka(char *stroka, int check);


const int status_codes[10] = {
    200, // OK - "Успешно". Запрос успешно обработан
    201, // Created - "Создано". Запрос успешно выполнен и в результате был создан ресурс. Этот код обычно присылается в ответ на запрос PUT "ПОМЕСТИТЬ"
    400, // Bad Request - "Плохой запрос". Этот ответ означает, что сервер не понимает запрос из-за неверного синтаксиса. 
    401, // Unauthorized - "Неавторизованно". Для получения запрашиваемого ответа нужна аутентификация. Статус похож на статус 403, но,в этом случае, аутентификация возможна. 
    403, // Forbidden - "Запрещено". У клиента нет прав доступа к содержимому, поэтому сервер отказывается дать надлежащий ответ. 
    404, // Not Found - "Не найден". Сервер не может найти запрашиваемый ресурс. Код этого ответа, наверно, самый известный из-за частоты его появления в вебе. 
    500, // Internal Server Error - "Внутренняя ошибка сервера". Сервер столкнулся с ситуацией, которую он не знает как обработать. 
    501, // Not Implemented - "Не выполнено". Метод запроса не поддерживается сервером и не может быть обработан.
    502, // Bad Gateway - "Плохой шлюз". Эта ошибка означает что сервер, во время работы в качестве шлюза для получения ответа, нужного для обработки запроса, получил недействительный (недопустимый) ответ. 
    503  // Service Unavailable - "Сервис недоступен". Сервер не готов обрабатывать запрос. Зачастую причинами являются отключение сервера или то, что он перегружен.
};
